as_1: (?, 298, 257, 96)
as_2: (?, 298, 257, 96)
as_3: (?, 298, 257, 96)
as_4: (?, 298, 257, 96)
as_5: (?, 298, 257, 96)
as_6: (?, 298, 257, 96)
as_7: (?, 298, 257, 96)
as_8: (?, 298, 257, 96)
as_9: (?, 298, 257, 96)
as_10: (?, 298, 257, 96)
as_11: (?, 298, 257, 96)
as_12: (?, 298, 257, 96)
as_13: (?, 298, 257, 96)
as_14: (?, 298, 257, 96)
as_15: (?, 298, 257, 8)
AS_out: (?, 298, 2056)
WARNING:tensorflow:From model_AV_new.py:23: The name tf.image.resize_bilinear is deprecated. Please use tf.compat.v1.image.resize_bilinear instead.

audio_input_mask: (?, 298, 257, 2, 2)
AVfusion: (?, 298, 2568)
lstm: (?, 298, 400)
fc1: (?, 298, 600)
fc2: (?, 298, 600)
fc3: (?, 298, 600)
complex_mask: (?, 298, 1028)
complex_mask_out: (?, 298, 257, 2, 2)
complex_mask_out: (?, 298, 257, 2, 2)
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 298, 257, 2)  0                                            
__________________________________________________________________________________________________
as_conv1 (Conv2D)               (None, 298, 257, 96) 1440        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 298, 257, 96) 384         as_conv1[0][0]                   
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 298, 257, 96) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
as_conv2 (Conv2D)               (None, 298, 257, 96) 64608       re_lu_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 298, 257, 96) 384         as_conv2[0][0]                   
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 298, 257, 96) 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
as_conv3 (Conv2D)               (None, 298, 257, 96) 230496      re_lu_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 298, 257, 96) 384         as_conv3[0][0]                   
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 298, 257, 96) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
as_conv4 (Conv2D)               (None, 298, 257, 96) 230496      re_lu_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 298, 257, 96) 384         as_conv4[0][0]                   
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 298, 257, 96) 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
as_conv5 (Conv2D)               (None, 298, 257, 96) 230496      re_lu_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 298, 257, 96) 384         as_conv5[0][0]                   
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 298, 257, 96) 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
as_conv6 (Conv2D)               (None, 298, 257, 96) 230496      re_lu_5[0][0]                    
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 298, 257, 96) 384         as_conv6[0][0]                   
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 298, 257, 96) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
as_conv7 (Conv2D)               (None, 298, 257, 96) 230496      re_lu_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 298, 257, 96) 384         as_conv7[0][0]                   
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 298, 257, 96) 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
as_conv8 (Conv2D)               (None, 298, 257, 96) 230496      re_lu_7[0][0]                    
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 298, 257, 96) 384         as_conv8[0][0]                   
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 298, 257, 96) 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
as_conv9 (Conv2D)               (None, 298, 257, 96) 230496      re_lu_8[0][0]                    
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 298, 257, 96) 384         as_conv9[0][0]                   
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 298, 257, 96) 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
as_conv10 (Conv2D)              (None, 298, 257, 96) 230496      re_lu_9[0][0]                    
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 298, 257, 96) 384         as_conv10[0][0]                  
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 298, 257, 96) 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
as_conv11 (Conv2D)              (None, 298, 257, 96) 230496      re_lu_10[0][0]                   
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 298, 257, 96) 384         as_conv11[0][0]                  
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 298, 257, 96) 0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
as_conv12 (Conv2D)              (None, 298, 257, 96) 230496      re_lu_11[0][0]                   
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 298, 257, 96) 384         as_conv12[0][0]                  
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 298, 257, 96) 0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
as_conv13 (Conv2D)              (None, 298, 257, 96) 230496      re_lu_12[0][0]                   
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 298, 257, 96) 384         as_conv13[0][0]                  
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 298, 257, 96) 0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
as_conv14 (Conv2D)              (None, 298, 257, 96) 230496      re_lu_13[0][0]                   
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 298, 257, 96) 384         as_conv14[0][0]                  
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, 298, 257, 96) 0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
as_conv15 (Conv2D)              (None, 298, 257, 8)  776         re_lu_14[0][0]                   
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 298, 257, 8)  32          as_conv15[0][0]                  
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 75, 1, 1792,  0                                            
__________________________________________________________________________________________________
re_lu_15 (ReLU)                 (None, 298, 257, 8)  0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 75, 1, 2)     0           input_2[0][0]                    
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 75, 1, 2)     0           input_2[0][0]                    
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 298, 2056)    0           re_lu_15[0][0]                   
__________________________________________________________________________________________________
sequential_1 (Sequential)       (None, 298, 256)     1649664     lambda_2[0][0]                   
                                                                 lambda_3[0][0]                   
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 298, 2568)    0           reshape_1[0][0]                  
                                                                 sequential_1[1][0]               
                                                                 sequential_1[2][0]               
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 298, 2568)    0           concatenate_2[0][0]              
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 298, 400)     9500800     time_distributed_1[0][0]         
__________________________________________________________________________________________________
fc1 (Dense)                     (None, 298, 600)     240600      bidirectional_1[0][0]            
__________________________________________________________________________________________________
fc2 (Dense)                     (None, 298, 600)     360600      fc1[0][0]                        
__________________________________________________________________________________________________
fc3 (Dense)                     (None, 298, 600)     360600      fc2[0][0]                        
__________________________________________________________________________________________________
complex_mask (Dense)            (None, 298, 1028)    617828      fc3[0][0]                        
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 298, 257, 2,  0           complex_mask[0][0]               
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 298, 257, 2,  0           reshape_5[0][0]                  
==================================================================================================
Total params: 15,568,276
Trainable params: 15,562,500
Non-trainable params: 5,776
__________________________________________________________________________________________________
None
